GopalSaraf/Practicals/PSDL/include/proc/pic18lf6680.inc
// Register: RXF8SIDL
#define RXF8SIDL RXF8SIDL
RXF8SIDL                                 equ 0D69h
// bitfield definitions
RXF8SIDL_EID16_POSN                      equ 0000h
RXF8SIDL_EID16_POSITION                  equ 0000h
RXF8SIDL_EID16_SIZE                      equ 0001h
RXF8SIDL_EID16_LENGTH                    equ 0001h
RXF8SIDL_EID16_MASK                      equ 0001h
RXF8SIDL_EID17_POSN                      equ 0001h
RXF8SIDL_EID17_POSITION                  equ 0001h
RXF8SIDL_EID17_SIZE                      equ 0001h
RXF8SIDL_EID17_LENGTH                    equ 0001h
RXF8SIDL_EID17_MASK                      equ 0002h
RXF8SIDL_EXIDEN_POSN                     equ 0003h
RXF8SIDL_EXIDEN_POSITION                 equ 0003h
RXF8SIDL_EXIDEN_SIZE                     equ 0001h
RXF8SIDL_EXIDEN_LENGTH                   equ 0001h
RXF8SIDL_EXIDEN_MASK                     equ 0008h
RXF8SIDL_SID0_POSN                       equ 0005h
RXF8SIDL_SID0_POSITION                   equ 0005h
RXF8SIDL_SID0_SIZE                       equ 0001h
RXF8SIDL_SID0_LENGTH                     equ 0001h
RXF8SIDL_SID0_MASK                       equ 0020h
RXF8SIDL_SID1_POSN                       equ 0006h
RXF8SIDL_SID1_POSITION                   equ 0006h
RXF8SIDL_SID1_SIZE                       equ 0001h
RXF8SIDL_SID1_LENGTH                     equ 0001h
RXF8SIDL_SID1_MASK                       equ 0040h
RXF8SIDL_SID2_POSN                       equ 0007h
RXF8SIDL_SID2_POSITION                   equ 0007h
RXF8SIDL_SID2_SIZE                       equ 0001h
RXF8SIDL_SID2_LENGTH                     equ 0001h
RXF8SIDL_SID2_MASK                       equ 0080h
RXF8SIDL_EXIDE_POSN                      equ 0003h
RXF8SIDL_EXIDE_POSITION                  equ 0003h
RXF8SIDL_EXIDE_SIZE                      equ 0001h
RXF8SIDL_EXIDE_LENGTH                    equ 0001h
RXF8SIDL_EXIDE_MASK                      equ 0008h
RXF8SIDL_RXF8EID16_POSN                  equ 0000h
RXF8SIDL_RXF8EID16_POSITION              equ 0000h
RXF8SIDL_RXF8EID16_SIZE                  equ 0001h
RXF8SIDL_RXF8EID16_LENGTH                equ 0001h
RXF8SIDL_RXF8EID16_MASK                  equ 0001h
RXF8SIDL_RXF8EID17_POSN                  equ 0001h
RXF8SIDL_RXF8EID17_POSITION              equ 0001h
RXF8SIDL_RXF8EID17_SIZE                  equ 0001h
RXF8SIDL_RXF8EID17_LENGTH                equ 0001h
RXF8SIDL_RXF8EID17_MASK                  equ 0002h
RXF8SIDL_RXF8EXIDEN_POSN                 equ 0003h
RXF8SIDL_RXF8EXIDEN_POSITION             equ 0003h
RXF8SIDL_RXF8EXIDEN_SIZE                 equ 0001h
RXF8SIDL_RXF8EXIDEN_LENGTH               equ 0001h
RXF8SIDL_RXF8EXIDEN_MASK                 equ 0008h
RXF8SIDL_RXF8SID0_POSN                   equ 0005h
RXF8SIDL_RXF8SID0_POSITION               equ 0005h
RXF8SIDL_RXF8SID0_SIZE                   equ 0001h
RXF8SIDL_RXF8SID0_LENGTH                 equ 0001h
RXF8SIDL_RXF8SID0_MASK                   equ 0020h
RXF8SIDL_RXF8SID1_POSN                   equ 0006h
RXF8SIDL_RXF8SID1_POSITION               equ 0006h
RXF8SIDL_RXF8SID1_SIZE                   equ 0001h
RXF8SIDL_RXF8SID1_LENGTH                 equ 0001h
RXF8SIDL_RXF8SID1_MASK                   equ 0040h
RXF8SIDL_RXF8SID2_POSN                   equ 0007h
RXF8SIDL_RXF8SID2_POSITION               equ 0007h
RXF8SIDL_RXF8SID2_SIZE                   equ 0001h
RXF8SIDL_RXF8SID2_LENGTH                 equ 0001h
RXF8SIDL_RXF8SID2_MASK                   equ 0080h

// Register: RXF8EIDH
#define RXF8EIDH RXF8EIDH
RXF8EIDH                                 equ 0D6Ah
// bitfield definitions
RXF8EIDH_EID8_POSN                       equ 0000h
RXF8EIDH_EID8_POSITION                   equ 0000h
RXF8EIDH_EID8_SIZE                       equ 0001h
RXF8EIDH_EID8_LENGTH                     equ 0001h
RXF8EIDH_EID8_MASK                       equ 0001h
RXF8EIDH_EID9_POSN                       equ 0001h
RXF8EIDH_EID9_POSITION                   equ 0001h
RXF8EIDH_EID9_SIZE                       equ 0001h
RXF8EIDH_EID9_LENGTH                     equ 0001h
RXF8EIDH_EID9_MASK                       equ 0002h
RXF8EIDH_EID10_POSN                      equ 0002h
RXF8EIDH_EID10_POSITION                  equ 0002h
RXF8EIDH_EID10_SIZE                      equ 0001h
RXF8EIDH_EID10_LENGTH                    equ 0001h
RXF8EIDH_EID10_MASK                      equ 0004h
RXF8EIDH_EID11_POSN                      equ 0003h
RXF8EIDH_EID11_POSITION                  equ 0003h
RXF8EIDH_EID11_SIZE                      equ 0001h
RXF8EIDH_EID11_LENGTH                    equ 0001h
RXF8EIDH_EID11_MASK                      equ 0008h
RXF8EIDH_EID12_POSN                      equ 0004h
RXF8EIDH_EID12_POSITION                  equ 0004h
RXF8EIDH_EID12_SIZE                      equ 0001h
RXF8EIDH_EID12_LENGTH                    equ 0001h
RXF8EIDH_EID12_MASK                      equ 0010h
RXF8EIDH_EID13_POSN                      equ 0005h
RXF8EIDH_EID13_POSITION                  equ 0005h
RXF8EIDH_EID13_SIZE                      equ 0001h
RXF8EIDH_EID13_LENGTH                    equ 0001h
RXF8EIDH_EID13_MASK                      equ 0020h
RXF8EIDH_EID14_POSN                      equ 0006h
RXF8EIDH_EID14_POSITION                  equ 0006h
RXF8EIDH_EID14_SIZE                      equ 0001h
RXF8EIDH_EID14_LENGTH                    equ 0001h
RXF8EIDH_EID14_MASK                      equ 0040h
RXF8EIDH_EID15_POSN                      equ 0007h
RXF8EIDH_EID15_POSITION                  equ 0007h
RXF8EIDH_EID15_SIZE                      equ 0001h
RXF8EIDH_EID15_LENGTH                    equ 0001h
RXF8EIDH_EID15_MASK                      equ 0080h
RXF8EIDH_RXF8EID8_POSN                   equ 0000h
RXF8EIDH_RXF8EID8_POSITION               equ 0000h
RXF8EIDH_RXF8EID8_SIZE                   equ 0001h
RXF8EIDH_RXF8EID8_LENGTH                 equ 0001h
RXF8EIDH_RXF8EID8_MASK                   equ 0001h
RXF8EIDH_RXF8EID9_POSN                   equ 0001h
RXF8EIDH_RXF8EID9_POSITION               equ 0001h
RXF8EIDH_RXF8EID9_SIZE                   equ 0001h
RXF8EIDH_RXF8EID9_LENGTH                 equ 0001h
RXF8EIDH_RXF8EID9_MASK                   equ 0002h
RXF8EIDH_RXF8EID10_POSN                  equ 0002h
RXF8EIDH_RXF8EID10_POSITION              equ 0002h
RXF8EIDH_RXF8EID10_SIZE                  equ 0001h
RXF8EIDH_RXF8EID10_LENGTH                equ 0001h
RXF8EIDH_RXF8EID10_MASK                  equ 0004h
RXF8EIDH_RXF8EID11_POSN                  equ 0003h
RXF8EIDH_RXF8EID11_POSITION              equ 0003h
RXF8EIDH_RXF8EID11_SIZE                  equ 0001h
RXF8EIDH_RXF8EID11_LENGTH                equ 0001h
RXF8EIDH_RXF8EID11_MASK                  equ 0008h
RXF8EIDH_RXF8EID12_POSN                  equ 0004h
RXF8EIDH_RXF8EID12_POSITION              equ 0004h
RXF8EIDH_RXF8EID12_SIZE                  equ 0001h
RXF8EIDH_RXF8EID12_LENGTH                equ 0001h
RXF8EIDH_RXF8EID12_MASK                  equ 0010h
RXF8EIDH_RXF8EID13_POSN                  equ 0005h
RXF8EIDH_RXF8EID13_POSITION              equ 0005h
RXF8EIDH_RXF8EID13_SIZE                  equ 0001h
RXF8EIDH_RXF8EID13_LENGTH                equ 0001h
RXF8EIDH_RXF8EID13_MASK                  equ 0020h
RXF8EIDH_RXF8EID14_POSN                  equ 0006h
RXF8EIDH_RXF8EID14_POSITION              equ 0006h
RXF8EIDH_RXF8EID14_SIZE                  equ 0001h
RXF8EIDH_RXF8EID14_LENGTH                equ 0001h
RXF8EIDH_RXF8EID14_MASK                  equ 0040h
RXF8EIDH_RXF8EID15_POSN                  equ 0007h
RXF8EIDH_RXF8EID15_POSITION              equ 0007h
RXF8EIDH_RXF8EID15_SIZE                  equ 0001h
RXF8EIDH_RXF8EID15_LENGTH                equ 0001h
RXF8EIDH_RXF8EID15_MASK                  equ 0080h

// Register: RXF8EIDL
#define RXF8EIDL RXF8EIDL
RXF8EIDL                                 equ 0D6Bh
// bitfield definitions
RXF8EIDL_EID0_POSN                       equ 0000h
RXF8EIDL_EID0_POSITION                   equ 0000h
RXF8EIDL_EID0_SIZE                       equ 0001h
RXF8EIDL_EID0_LENGTH                     equ 0001h
RXF8EIDL_EID0_MASK                       equ 0001h
RXF8EIDL_EID1_POSN                       equ 0001h
RXF8EIDL_EID1_POSITION                   equ 0001h
RXF8EIDL_EID1_SIZE                       equ 0001h
RXF8EIDL_EID1_LENGTH                     equ 0001h
RXF8EIDL_EID1_MASK                       equ 0002h
RXF8EIDL_EID2_POSN                       equ 0002h
RXF8EIDL_EID2_POSITION                   equ 0002h
RXF8EIDL_EID2_SIZE                       equ 0001h
RXF8EIDL_EID2_LENGTH                     equ 0001h
RXF8EIDL_EID2_MASK                       equ 0004h
RXF8EIDL_EID3_POSN                       equ 0003h
RXF8EIDL_EID3_POSITION                   equ 0003h
RXF8EIDL_EID3_SIZE                       equ 0001h
RXF8EIDL_EID3_LENGTH                     equ 0001h
RXF8EIDL_EID3_MASK                       equ 0008h
RXF8EIDL_EID4_POSN                       equ 0004h
RXF8EIDL_EID4_POSITION                   equ 0004h
RXF8EIDL_EID4_SIZE                       equ 0001h
RXF8EIDL_EID4_LENGTH                     equ 0001h
RXF8EIDL_EID4_MASK                       equ 0010h
RXF8EIDL_EID5_POSN                       equ 0005h
RXF8EIDL_EID5_POSITION                   equ 0005h
RXF8EIDL_EID5_SIZE                       equ 0001h
RXF8EIDL_EID5_LENGTH                     equ 0001h
RXF8EIDL_EID5_MASK                       equ 0020h
RXF8EIDL_EID6_POSN                       equ 0006h
RXF8EIDL_EID6_POSITION                   equ 0006h
RXF8EIDL_EID6_SIZE                       equ 0001h
RXF8EIDL_EID6_LENGTH                     equ 0001h
RXF8EIDL_EID6_MASK                       equ 0040h
RXF8EIDL_EID7_POSN                       equ 0007h
RXF8EIDL_EID7_POSITION                   equ 0007h
RXF8EIDL_EID7_SIZE                       equ 0001h
RXF8EIDL_EID7_LENGTH                     equ 0001h
RXF8EIDL_EID7_MASK                       equ 0080h
RXF8EIDL_RXF8EID0_POSN                   equ 0000h
RXF8EIDL_RXF8EID0_POSITION               equ 0000h
RXF8EIDL_RXF8EID0_SIZE                   equ 0001h
RXF8EIDL_RXF8EID0_LENGTH                 equ 0001h
RXF8EIDL_RXF8EID0_MASK                   equ 0001h
RXF8EIDL_RXF8EID1_POSN                   equ 0001h
RXF8EIDL_RXF8EID1_POSITION               equ 0001h
RXF8EIDL_RXF8EID1_SIZE                   equ 0001h
RXF8EIDL_RXF8EID1_LENGTH                 equ 0001h
RXF8EIDL_RXF8EID1_MASK                   equ 0002h
RXF8EIDL_RXF8EID2_POSN                   equ 0002h
RXF8EIDL_RXF8EID2_POSITION               equ 0002h
RXF8EIDL_RXF8EID2_SIZE                   equ 0001h
RXF8EIDL_RXF8EID2_LENGTH                 equ 0001h
RXF8EIDL_RXF8EID2_MASK                   equ 0004h
RXF8EIDL_RXF8EID3_POSN                   equ 0003h
RXF8EIDL_RXF8EID3_POSITION               equ 0003h
RXF8EIDL_RXF8EID3_SIZE                   equ 0001h
RXF8EIDL_RXF8EID3_LENGTH                 equ 0001h
RXF8EIDL_RXF8EID3_MASK                   equ 0008h
RXF8EIDL_RXF8EID4_POSN                   equ 0004h
RXF8EIDL_RXF8EID4_POSITION               equ 0004h
RXF8EIDL_RXF8EID4_SIZE                   equ 0001h
RXF8EIDL_RXF8EID4_LENGTH                 equ 0001h
RXF8EIDL_RXF8EID4_MASK                   equ 0010h
RXF8EIDL_RXF8EID5_POSN                   equ 0005h
RXF8EIDL_RXF8EID5_POSITION               equ 0005h
RXF8EIDL_RXF8EID5_SIZE                   equ 0001h
RXF8EIDL_RXF8EID5_LENGTH                 equ 0001h
RXF8EIDL_RXF8EID5_MASK                   equ 0020h
RXF8EIDL_RXF8EID6_POSN                   equ 0006h
RXF8EIDL_RXF8EID6_POSITION               equ 0006h
RXF8EIDL_RXF8EID6_SIZE                   equ 0001h
RXF8EIDL_RXF8EID6_LENGTH                 equ 0001h
RXF8EIDL_RXF8EID6_MASK                   equ 0040h
RXF8EIDL_RXF8EID7_POSN                   equ 0007h
RXF8EIDL_RXF8EID7_POSITION               equ 0007h
RXF8EIDL_RXF8EID7_SIZE                   equ 0001h
RXF8EIDL_RXF8EID7_LENGTH                 equ 0001h
RXF8EIDL_RXF8EID7_MASK                   equ 0080h

// Register: RXF9SIDH
#define RXF9SIDH RXF9SIDH
RXF9SIDH                                 equ 0D70h
// bitfield definitions
RXF9SIDH_SID3_POSN                       equ 0000h
RXF9SIDH_SID3_POSITION                   equ 0000h
RXF9SIDH_SID3_SIZE                       equ 0001h
RXF9SIDH_SID3_LENGTH                     equ 0001h
RXF9SIDH_SID3_MASK                       equ 0001h
RXF9SIDH_SID4_POSN                       equ 0001h
RXF9SIDH_SID4_POSITION                   equ 0001h
RXF9SIDH_SID4_SIZE                       equ 0001h
RXF9SIDH_SID4_LENGTH                     equ 0001h
RXF9SIDH_SID4_MASK                       equ 0002h
RXF9SIDH_SID5_POSN                       equ 0002h
RXF9SIDH_SID5_POSITION                   equ 0002h
RXF9SIDH_SID5_SIZE                       equ 0001h
RXF9SIDH_SID5_LENGTH                     equ 0001h
RXF9SIDH_SID5_MASK                       equ 0004h
RXF9SIDH_SID6_POSN                       equ 0003h
RXF9SIDH_SID6_POSITION                   equ 0003h
RXF9SIDH_SID6_SIZE                       equ 0001h
RXF9SIDH_SID6_LENGTH                     equ 0001h
RXF9SIDH_SID6_MASK                       equ 0008h
RXF9SIDH_SID7_POSN                       equ 0004h
RXF9SIDH_SID7_POSITION                   equ 0004h
RXF9SIDH_SID7_SIZE                       equ 0001h
RXF9SIDH_SID7_LENGTH                     equ 0001h
RXF9SIDH_SID7_MASK                       equ 0010h
RXF9SIDH_SID8_POSN                       equ 0005h
RXF9SIDH_SID8_POSITION                   equ 0005h
RXF9SIDH_SID8_SIZE                       equ 0001h
RXF9SIDH_SID8_LENGTH                     equ 0001h
RXF9SIDH_SID8_MASK                       equ 0020h
RXF9SIDH_SID9_POSN                       equ 0006h
RXF9SIDH_SID9_POSITION                   equ 0006h
RXF9SIDH_SID9_SIZE                       equ 0001h
RXF9SIDH_SID9_LENGTH                     equ 0001h
RXF9SIDH_SID9_MASK                       equ 0040h
RXF9SIDH_SID10_POSN                      equ 0007h
RXF9SIDH_SID10_POSITION                  equ 0007h
RXF9SIDH_SID10_SIZE                      equ 0001h
RXF9SIDH_SID10_LENGTH                    equ 0001h
RXF9SIDH_SID10_MASK                      equ 0080h
RXF9SIDH_RXF9SID3_POSN                   equ 0000h
RXF9SIDH_RXF9SID3_POSITION               equ 0000h
RXF9SIDH_RXF9SID3_SIZE                   equ 0001h
RXF9SIDH_RXF9SID3_LENGTH                 equ 0001h
RXF9SIDH_RXF9SID3_MASK                   equ 0001h
RXF9SIDH_RXF9SID4_POSN                   equ 0001h
RXF9SIDH_RXF9SID4_POSITION               equ 0001h
RXF9SIDH_RXF9SID4_SIZE                   equ 0001h
RXF9SIDH_RXF9SID4_LENGTH                 equ 0001h
RXF9SIDH_RXF9SID4_MASK                   equ 0002h
RXF9SIDH_RXF9SID5_POSN                   equ 0002h
RXF9SIDH_RXF9SID5_POSITION               equ 0002h
RXF9SIDH_RXF9SID5_SIZE                   equ 0001h
RXF9SIDH_RXF9SID5_LENGTH                 equ 0001h
RXF9SIDH_RXF9SID5_MASK                   equ 0004h
RXF9SIDH_RXF9SID6_POSN                   equ 0003h
RXF9SIDH_RXF9SID6_POSITION               equ 0003h
RXF9SIDH_RXF9SID6_SIZE                   equ 0001h
RXF9SIDH_RXF9SID6_LENGTH                 equ 0001h
RXF9SIDH_RXF9SID6_MASK                   equ 0008h
RXF9SIDH_RXF9SID7_POSN                   equ 0004h
RXF9SIDH_RXF9SID7_POSITION               equ 0004h
RXF9SIDH_RXF9SID7_SIZE                   equ 0001h
RXF9SIDH_RXF9SID7_LENGTH                 equ 0001h
RXF9SIDH_RXF9SID7_MASK                   equ 0010h
RXF9SIDH_RXF9SID8_POSN                   equ 0005h
RXF9SIDH_RXF9SID8_POSITION               equ 0005h
RXF9SIDH_RXF9SID8_SIZE                   equ 0001h
RXF9SIDH_RXF9SID8_LENGTH                 equ 0001h
RXF9SIDH_RXF9SID8_MASK                   equ 0020h
RXF9SIDH_RXF9SID9_POSN                   equ 0006h
RXF9SIDH_RXF9SID9_POSITION               equ 0006h
RXF9SIDH_RXF9SID9_SIZE                   equ 0001h
RXF9SIDH_RXF9SID9_LENGTH                 equ 0001h
RXF9SIDH_RXF9SID9_MASK                   equ 0040h
RXF9SIDH_RXF9SID10_POSN                  equ 0007h
RXF9SIDH_RXF9SID10_POSITION              equ 0007h
RXF9SIDH_RXF9SID10_SIZE                  equ 0001h
RXF9SIDH_RXF9SID10_LENGTH                equ 0001h
RXF9SIDH_RXF9SID10_MASK                  equ 0080h

