GopalSaraf/Practicals/PSDL/include/proc/pic18lf6680.inc
// Register: CANSTAT_RO3
#define CANSTAT_RO3 CANSTAT_RO3
CANSTAT_RO3                              equ 0F2Eh
// bitfield definitions
CANSTAT_RO3_EICODE0_POSN                 equ 0000h
CANSTAT_RO3_EICODE0_POSITION             equ 0000h
CANSTAT_RO3_EICODE0_SIZE                 equ 0001h
CANSTAT_RO3_EICODE0_LENGTH               equ 0001h
CANSTAT_RO3_EICODE0_MASK                 equ 0001h
CANSTAT_RO3_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_RO3_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_RO3_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_RO3_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_RO3_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_RO3_EICODE2_ICODE1_POSN          equ 0002h
CANSTAT_RO3_EICODE2_ICODE1_POSITION      equ 0002h
CANSTAT_RO3_EICODE2_ICODE1_SIZE          equ 0001h
CANSTAT_RO3_EICODE2_ICODE1_LENGTH        equ 0001h
CANSTAT_RO3_EICODE2_ICODE1_MASK          equ 0004h
CANSTAT_RO3_EICODE3_ICODE2_POSN          equ 0003h
CANSTAT_RO3_EICODE3_ICODE2_POSITION      equ 0003h
CANSTAT_RO3_EICODE3_ICODE2_SIZE          equ 0001h
CANSTAT_RO3_EICODE3_ICODE2_LENGTH        equ 0001h
CANSTAT_RO3_EICODE3_ICODE2_MASK          equ 0008h
CANSTAT_RO3_EICODE4_POSN                 equ 0004h
CANSTAT_RO3_EICODE4_POSITION             equ 0004h
CANSTAT_RO3_EICODE4_SIZE                 equ 0001h
CANSTAT_RO3_EICODE4_LENGTH               equ 0001h
CANSTAT_RO3_EICODE4_MASK                 equ 0010h
CANSTAT_RO3_OPMODE0_POSN                 equ 0005h
CANSTAT_RO3_OPMODE0_POSITION             equ 0005h
CANSTAT_RO3_OPMODE0_SIZE                 equ 0001h
CANSTAT_RO3_OPMODE0_LENGTH               equ 0001h
CANSTAT_RO3_OPMODE0_MASK                 equ 0020h
CANSTAT_RO3_OPMODE1_POSN                 equ 0006h
CANSTAT_RO3_OPMODE1_POSITION             equ 0006h
CANSTAT_RO3_OPMODE1_SIZE                 equ 0001h
CANSTAT_RO3_OPMODE1_LENGTH               equ 0001h
CANSTAT_RO3_OPMODE1_MASK                 equ 0040h
CANSTAT_RO3_OPMODE2_POSN                 equ 0007h
CANSTAT_RO3_OPMODE2_POSITION             equ 0007h
CANSTAT_RO3_OPMODE2_SIZE                 equ 0001h
CANSTAT_RO3_OPMODE2_LENGTH               equ 0001h
CANSTAT_RO3_OPMODE2_MASK                 equ 0080h

// Register: CANCON_RO3
#define CANCON_RO3 CANCON_RO3
CANCON_RO3                               equ 0F2Fh
// bitfield definitions
CANCON_RO3_FP0_POSN                      equ 0000h
CANCON_RO3_FP0_POSITION                  equ 0000h
CANCON_RO3_FP0_SIZE                      equ 0001h
CANCON_RO3_FP0_LENGTH                    equ 0001h
CANCON_RO3_FP0_MASK                      equ 0001h
CANCON_RO3_WIN0_FP1_POSN                 equ 0001h
CANCON_RO3_WIN0_FP1_POSITION             equ 0001h
CANCON_RO3_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO3_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO3_WIN0_FP1_MASK                 equ 0002h
CANCON_RO3_WIN1_FP2_POSN                 equ 0002h
CANCON_RO3_WIN1_FP2_POSITION             equ 0002h
CANCON_RO3_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO3_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO3_WIN1_FP2_MASK                 equ 0004h
CANCON_RO3_WIN2_FP3_POSN                 equ 0003h
CANCON_RO3_WIN2_FP3_POSITION             equ 0003h
CANCON_RO3_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO3_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO3_WIN2_FP3_MASK                 equ 0008h
CANCON_RO3_ABAT_POSN                     equ 0004h
CANCON_RO3_ABAT_POSITION                 equ 0004h
CANCON_RO3_ABAT_SIZE                     equ 0001h
CANCON_RO3_ABAT_LENGTH                   equ 0001h
CANCON_RO3_ABAT_MASK                     equ 0010h
CANCON_RO3_REQOP0_POSN                   equ 0005h
CANCON_RO3_REQOP0_POSITION               equ 0005h
CANCON_RO3_REQOP0_SIZE                   equ 0001h
CANCON_RO3_REQOP0_LENGTH                 equ 0001h
CANCON_RO3_REQOP0_MASK                   equ 0020h
CANCON_RO3_REQOP1_POSN                   equ 0006h
CANCON_RO3_REQOP1_POSITION               equ 0006h
CANCON_RO3_REQOP1_SIZE                   equ 0001h
CANCON_RO3_REQOP1_LENGTH                 equ 0001h
CANCON_RO3_REQOP1_MASK                   equ 0040h
CANCON_RO3_REQOP2_POSN                   equ 0007h
CANCON_RO3_REQOP2_POSITION               equ 0007h
CANCON_RO3_REQOP2_SIZE                   equ 0001h
CANCON_RO3_REQOP2_LENGTH                 equ 0001h
CANCON_RO3_REQOP2_MASK                   equ 0080h

// Register: TXB1CON
#define TXB1CON TXB1CON
TXB1CON                                  equ 0F30h
// bitfield definitions
TXB1CON_TXPRI0_POSN                      equ 0000h
TXB1CON_TXPRI0_POSITION                  equ 0000h
TXB1CON_TXPRI0_SIZE                      equ 0001h
TXB1CON_TXPRI0_LENGTH                    equ 0001h
TXB1CON_TXPRI0_MASK                      equ 0001h
TXB1CON_TXPRI1_POSN                      equ 0001h
TXB1CON_TXPRI1_POSITION                  equ 0001h
TXB1CON_TXPRI1_SIZE                      equ 0001h
TXB1CON_TXPRI1_LENGTH                    equ 0001h
TXB1CON_TXPRI1_MASK                      equ 0002h
TXB1CON_TXREQ_POSN                       equ 0003h
TXB1CON_TXREQ_POSITION                   equ 0003h
TXB1CON_TXREQ_SIZE                       equ 0001h
TXB1CON_TXREQ_LENGTH                     equ 0001h
TXB1CON_TXREQ_MASK                       equ 0008h
TXB1CON_TXERR_POSN                       equ 0004h
TXB1CON_TXERR_POSITION                   equ 0004h
TXB1CON_TXERR_SIZE                       equ 0001h
TXB1CON_TXERR_LENGTH                     equ 0001h
TXB1CON_TXERR_MASK                       equ 0010h
TXB1CON_TXLARB_POSN                      equ 0005h
TXB1CON_TXLARB_POSITION                  equ 0005h
TXB1CON_TXLARB_SIZE                      equ 0001h
TXB1CON_TXLARB_LENGTH                    equ 0001h
TXB1CON_TXLARB_MASK                      equ 0020h
TXB1CON_TXABT_POSN                       equ 0006h
TXB1CON_TXABT_POSITION                   equ 0006h
TXB1CON_TXABT_SIZE                       equ 0001h
TXB1CON_TXABT_LENGTH                     equ 0001h
TXB1CON_TXABT_MASK                       equ 0040h
TXB1CON_TXBIF_POSN                       equ 0007h
TXB1CON_TXBIF_POSITION                   equ 0007h
TXB1CON_TXBIF_SIZE                       equ 0001h
TXB1CON_TXBIF_LENGTH                     equ 0001h
TXB1CON_TXBIF_MASK                       equ 0080h
TXB1CON_TXBIFTXB1CON_POSN                equ 0007h
TXB1CON_TXBIFTXB1CON_POSITION            equ 0007h
TXB1CON_TXBIFTXB1CON_SIZE                equ 0001h
TXB1CON_TXBIFTXB1CON_LENGTH              equ 0001h
TXB1CON_TXBIFTXB1CON_MASK                equ 0080h
TXB1CON_TXB1PRI0_POSN                    equ 0000h
TXB1CON_TXB1PRI0_POSITION                equ 0000h
TXB1CON_TXB1PRI0_SIZE                    equ 0001h
TXB1CON_TXB1PRI0_LENGTH                  equ 0001h
TXB1CON_TXB1PRI0_MASK                    equ 0001h
TXB1CON_TXB1PRI1_POSN                    equ 0001h
TXB1CON_TXB1PRI1_POSITION                equ 0001h
TXB1CON_TXB1PRI1_SIZE                    equ 0001h
TXB1CON_TXB1PRI1_LENGTH                  equ 0001h
TXB1CON_TXB1PRI1_MASK                    equ 0002h
TXB1CON_TXB1REQ_POSN                     equ 0003h
TXB1CON_TXB1REQ_POSITION                 equ 0003h
TXB1CON_TXB1REQ_SIZE                     equ 0001h
TXB1CON_TXB1REQ_LENGTH                   equ 0001h
TXB1CON_TXB1REQ_MASK                     equ 0008h
TXB1CON_TXB1ERR_POSN                     equ 0004h
TXB1CON_TXB1ERR_POSITION                 equ 0004h
TXB1CON_TXB1ERR_SIZE                     equ 0001h
TXB1CON_TXB1ERR_LENGTH                   equ 0001h
TXB1CON_TXB1ERR_MASK                     equ 0010h
TXB1CON_TXB1LARB_POSN                    equ 0005h
TXB1CON_TXB1LARB_POSITION                equ 0005h
TXB1CON_TXB1LARB_SIZE                    equ 0001h
TXB1CON_TXB1LARB_LENGTH                  equ 0001h
TXB1CON_TXB1LARB_MASK                    equ 0020h
TXB1CON_TXB1ABT_POSN                     equ 0006h
TXB1CON_TXB1ABT_POSITION                 equ 0006h
TXB1CON_TXB1ABT_SIZE                     equ 0001h
TXB1CON_TXB1ABT_LENGTH                   equ 0001h
TXB1CON_TXB1ABT_MASK                     equ 0040h
TXB1CON_TX1IF_POSN                       equ 0007h
TXB1CON_TX1IF_POSITION                   equ 0007h
TXB1CON_TX1IF_SIZE                       equ 0001h
TXB1CON_TX1IF_LENGTH                     equ 0001h
TXB1CON_TX1IF_MASK                       equ 0080h

// Register: TXB1SIDH
#define TXB1SIDH TXB1SIDH
TXB1SIDH                                 equ 0F31h
// bitfield definitions
TXB1SIDH_SID3_POSN                       equ 0000h
TXB1SIDH_SID3_POSITION                   equ 0000h
TXB1SIDH_SID3_SIZE                       equ 0001h
TXB1SIDH_SID3_LENGTH                     equ 0001h
TXB1SIDH_SID3_MASK                       equ 0001h
TXB1SIDH_SID4_POSN                       equ 0001h
TXB1SIDH_SID4_POSITION                   equ 0001h
TXB1SIDH_SID4_SIZE                       equ 0001h
TXB1SIDH_SID4_LENGTH                     equ 0001h
TXB1SIDH_SID4_MASK                       equ 0002h
TXB1SIDH_SID5_POSN                       equ 0002h
TXB1SIDH_SID5_POSITION                   equ 0002h
TXB1SIDH_SID5_SIZE                       equ 0001h
TXB1SIDH_SID5_LENGTH                     equ 0001h
TXB1SIDH_SID5_MASK                       equ 0004h
TXB1SIDH_SID6_POSN                       equ 0003h
TXB1SIDH_SID6_POSITION                   equ 0003h
TXB1SIDH_SID6_SIZE                       equ 0001h
TXB1SIDH_SID6_LENGTH                     equ 0001h
TXB1SIDH_SID6_MASK                       equ 0008h
TXB1SIDH_SID7_POSN                       equ 0004h
TXB1SIDH_SID7_POSITION                   equ 0004h
TXB1SIDH_SID7_SIZE                       equ 0001h
TXB1SIDH_SID7_LENGTH                     equ 0001h
TXB1SIDH_SID7_MASK                       equ 0010h
TXB1SIDH_SID8_POSN                       equ 0005h
TXB1SIDH_SID8_POSITION                   equ 0005h
TXB1SIDH_SID8_SIZE                       equ 0001h
TXB1SIDH_SID8_LENGTH                     equ 0001h
TXB1SIDH_SID8_MASK                       equ 0020h
TXB1SIDH_SID9_POSN                       equ 0006h
TXB1SIDH_SID9_POSITION                   equ 0006h
TXB1SIDH_SID9_SIZE                       equ 0001h
TXB1SIDH_SID9_LENGTH                     equ 0001h
TXB1SIDH_SID9_MASK                       equ 0040h
TXB1SIDH_SID10_POSN                      equ 0007h
TXB1SIDH_SID10_POSITION                  equ 0007h
TXB1SIDH_SID10_SIZE                      equ 0001h
TXB1SIDH_SID10_LENGTH                    equ 0001h
TXB1SIDH_SID10_MASK                      equ 0080h
TXB1SIDH_TXB1SID3_POSN                   equ 0000h
TXB1SIDH_TXB1SID3_POSITION               equ 0000h
TXB1SIDH_TXB1SID3_SIZE                   equ 0001h
TXB1SIDH_TXB1SID3_LENGTH                 equ 0001h
TXB1SIDH_TXB1SID3_MASK                   equ 0001h
TXB1SIDH_TXB1SID4_POSN                   equ 0001h
TXB1SIDH_TXB1SID4_POSITION               equ 0001h
TXB1SIDH_TXB1SID4_SIZE                   equ 0001h
TXB1SIDH_TXB1SID4_LENGTH                 equ 0001h
TXB1SIDH_TXB1SID4_MASK                   equ 0002h
TXB1SIDH_TXB1SID5_POSN                   equ 0002h
TXB1SIDH_TXB1SID5_POSITION               equ 0002h
TXB1SIDH_TXB1SID5_SIZE                   equ 0001h
TXB1SIDH_TXB1SID5_LENGTH                 equ 0001h
TXB1SIDH_TXB1SID5_MASK                   equ 0004h
TXB1SIDH_TXB1SID6_POSN                   equ 0003h
TXB1SIDH_TXB1SID6_POSITION               equ 0003h
TXB1SIDH_TXB1SID6_SIZE                   equ 0001h
TXB1SIDH_TXB1SID6_LENGTH                 equ 0001h
TXB1SIDH_TXB1SID6_MASK                   equ 0008h
TXB1SIDH_TXB1SID7_POSN                   equ 0004h
TXB1SIDH_TXB1SID7_POSITION               equ 0004h
TXB1SIDH_TXB1SID7_SIZE                   equ 0001h
TXB1SIDH_TXB1SID7_LENGTH                 equ 0001h
TXB1SIDH_TXB1SID7_MASK                   equ 0010h
TXB1SIDH_TXB1SID8_POSN                   equ 0005h
TXB1SIDH_TXB1SID8_POSITION               equ 0005h
TXB1SIDH_TXB1SID8_SIZE                   equ 0001h
TXB1SIDH_TXB1SID8_LENGTH                 equ 0001h
TXB1SIDH_TXB1SID8_MASK                   equ 0020h
TXB1SIDH_TXB1SID9_POSN                   equ 0006h
TXB1SIDH_TXB1SID9_POSITION               equ 0006h
TXB1SIDH_TXB1SID9_SIZE                   equ 0001h
TXB1SIDH_TXB1SID9_LENGTH                 equ 0001h
TXB1SIDH_TXB1SID9_MASK                   equ 0040h
TXB1SIDH_TXB1SID10_POSN                  equ 0007h
TXB1SIDH_TXB1SID10_POSITION              equ 0007h
TXB1SIDH_TXB1SID10_SIZE                  equ 0001h
TXB1SIDH_TXB1SID10_LENGTH                equ 0001h
TXB1SIDH_TXB1SID10_MASK                  equ 0080h

