GopalSaraf/Practicals/PSDL/include/proc/pic18lf6680.inc
// Register: RXB1D1
#define RXB1D1 RXB1D1
RXB1D1                                   equ 0F57h
// bitfield definitions
RXB1D1_RXB1D10_POSN                      equ 0000h
RXB1D1_RXB1D10_POSITION                  equ 0000h
RXB1D1_RXB1D10_SIZE                      equ 0001h
RXB1D1_RXB1D10_LENGTH                    equ 0001h
RXB1D1_RXB1D10_MASK                      equ 0001h
RXB1D1_RXB1D11_POSN                      equ 0001h
RXB1D1_RXB1D11_POSITION                  equ 0001h
RXB1D1_RXB1D11_SIZE                      equ 0001h
RXB1D1_RXB1D11_LENGTH                    equ 0001h
RXB1D1_RXB1D11_MASK                      equ 0002h
RXB1D1_RXB1D12_POSN                      equ 0002h
RXB1D1_RXB1D12_POSITION                  equ 0002h
RXB1D1_RXB1D12_SIZE                      equ 0001h
RXB1D1_RXB1D12_LENGTH                    equ 0001h
RXB1D1_RXB1D12_MASK                      equ 0004h
RXB1D1_RXB1D13_POSN                      equ 0003h
RXB1D1_RXB1D13_POSITION                  equ 0003h
RXB1D1_RXB1D13_SIZE                      equ 0001h
RXB1D1_RXB1D13_LENGTH                    equ 0001h
RXB1D1_RXB1D13_MASK                      equ 0008h
RXB1D1_RXB1D14_POSN                      equ 0004h
RXB1D1_RXB1D14_POSITION                  equ 0004h
RXB1D1_RXB1D14_SIZE                      equ 0001h
RXB1D1_RXB1D14_LENGTH                    equ 0001h
RXB1D1_RXB1D14_MASK                      equ 0010h
RXB1D1_RXB1D15_POSN                      equ 0005h
RXB1D1_RXB1D15_POSITION                  equ 0005h
RXB1D1_RXB1D15_SIZE                      equ 0001h
RXB1D1_RXB1D15_LENGTH                    equ 0001h
RXB1D1_RXB1D15_MASK                      equ 0020h
RXB1D1_RXB1D16_POSN                      equ 0006h
RXB1D1_RXB1D16_POSITION                  equ 0006h
RXB1D1_RXB1D16_SIZE                      equ 0001h
RXB1D1_RXB1D16_LENGTH                    equ 0001h
RXB1D1_RXB1D16_MASK                      equ 0040h
RXB1D1_RXB1D17_POSN                      equ 0007h
RXB1D1_RXB1D17_POSITION                  equ 0007h
RXB1D1_RXB1D17_SIZE                      equ 0001h
RXB1D1_RXB1D17_LENGTH                    equ 0001h
RXB1D1_RXB1D17_MASK                      equ 0080h

// Register: RXB1D2
#define RXB1D2 RXB1D2
RXB1D2                                   equ 0F58h
// bitfield definitions
RXB1D2_RXB1D20_POSN                      equ 0000h
RXB1D2_RXB1D20_POSITION                  equ 0000h
RXB1D2_RXB1D20_SIZE                      equ 0001h
RXB1D2_RXB1D20_LENGTH                    equ 0001h
RXB1D2_RXB1D20_MASK                      equ 0001h
RXB1D2_RXB1D21_POSN                      equ 0001h
RXB1D2_RXB1D21_POSITION                  equ 0001h
RXB1D2_RXB1D21_SIZE                      equ 0001h
RXB1D2_RXB1D21_LENGTH                    equ 0001h
RXB1D2_RXB1D21_MASK                      equ 0002h
RXB1D2_RXB1D22_POSN                      equ 0002h
RXB1D2_RXB1D22_POSITION                  equ 0002h
RXB1D2_RXB1D22_SIZE                      equ 0001h
RXB1D2_RXB1D22_LENGTH                    equ 0001h
RXB1D2_RXB1D22_MASK                      equ 0004h
RXB1D2_RXB1D23_POSN                      equ 0003h
RXB1D2_RXB1D23_POSITION                  equ 0003h
RXB1D2_RXB1D23_SIZE                      equ 0001h
RXB1D2_RXB1D23_LENGTH                    equ 0001h
RXB1D2_RXB1D23_MASK                      equ 0008h
RXB1D2_RXB1D24_POSN                      equ 0004h
RXB1D2_RXB1D24_POSITION                  equ 0004h
RXB1D2_RXB1D24_SIZE                      equ 0001h
RXB1D2_RXB1D24_LENGTH                    equ 0001h
RXB1D2_RXB1D24_MASK                      equ 0010h
RXB1D2_RXB1D25_POSN                      equ 0005h
RXB1D2_RXB1D25_POSITION                  equ 0005h
RXB1D2_RXB1D25_SIZE                      equ 0001h
RXB1D2_RXB1D25_LENGTH                    equ 0001h
RXB1D2_RXB1D25_MASK                      equ 0020h
RXB1D2_RXB1D26_POSN                      equ 0006h
RXB1D2_RXB1D26_POSITION                  equ 0006h
RXB1D2_RXB1D26_SIZE                      equ 0001h
RXB1D2_RXB1D26_LENGTH                    equ 0001h
RXB1D2_RXB1D26_MASK                      equ 0040h
RXB1D2_RXB1D27_POSN                      equ 0007h
RXB1D2_RXB1D27_POSITION                  equ 0007h
RXB1D2_RXB1D27_SIZE                      equ 0001h
RXB1D2_RXB1D27_LENGTH                    equ 0001h
RXB1D2_RXB1D27_MASK                      equ 0080h

// Register: RXB1D3
#define RXB1D3 RXB1D3
RXB1D3                                   equ 0F59h
// bitfield definitions
RXB1D3_RXB1D30_POSN                      equ 0000h
RXB1D3_RXB1D30_POSITION                  equ 0000h
RXB1D3_RXB1D30_SIZE                      equ 0001h
RXB1D3_RXB1D30_LENGTH                    equ 0001h
RXB1D3_RXB1D30_MASK                      equ 0001h
RXB1D3_RXB1D31_POSN                      equ 0001h
RXB1D3_RXB1D31_POSITION                  equ 0001h
RXB1D3_RXB1D31_SIZE                      equ 0001h
RXB1D3_RXB1D31_LENGTH                    equ 0001h
RXB1D3_RXB1D31_MASK                      equ 0002h
RXB1D3_RXB1D32_POSN                      equ 0002h
RXB1D3_RXB1D32_POSITION                  equ 0002h
RXB1D3_RXB1D32_SIZE                      equ 0001h
RXB1D3_RXB1D32_LENGTH                    equ 0001h
RXB1D3_RXB1D32_MASK                      equ 0004h
RXB1D3_RXB1D33_POSN                      equ 0003h
RXB1D3_RXB1D33_POSITION                  equ 0003h
RXB1D3_RXB1D33_SIZE                      equ 0001h
RXB1D3_RXB1D33_LENGTH                    equ 0001h
RXB1D3_RXB1D33_MASK                      equ 0008h
RXB1D3_RXB1D34_POSN                      equ 0004h
RXB1D3_RXB1D34_POSITION                  equ 0004h
RXB1D3_RXB1D34_SIZE                      equ 0001h
RXB1D3_RXB1D34_LENGTH                    equ 0001h
RXB1D3_RXB1D34_MASK                      equ 0010h
RXB1D3_RXB1D35_POSN                      equ 0005h
RXB1D3_RXB1D35_POSITION                  equ 0005h
RXB1D3_RXB1D35_SIZE                      equ 0001h
RXB1D3_RXB1D35_LENGTH                    equ 0001h
RXB1D3_RXB1D35_MASK                      equ 0020h
RXB1D3_RXB1D36_POSN                      equ 0006h
RXB1D3_RXB1D36_POSITION                  equ 0006h
RXB1D3_RXB1D36_SIZE                      equ 0001h
RXB1D3_RXB1D36_LENGTH                    equ 0001h
RXB1D3_RXB1D36_MASK                      equ 0040h
RXB1D3_RXB1D37_POSN                      equ 0007h
RXB1D3_RXB1D37_POSITION                  equ 0007h
RXB1D3_RXB1D37_SIZE                      equ 0001h
RXB1D3_RXB1D37_LENGTH                    equ 0001h
RXB1D3_RXB1D37_MASK                      equ 0080h

// Register: RXB1D4
#define RXB1D4 RXB1D4
RXB1D4                                   equ 0F5Ah
// bitfield definitions
RXB1D4_RXB1D40_POSN                      equ 0000h
RXB1D4_RXB1D40_POSITION                  equ 0000h
RXB1D4_RXB1D40_SIZE                      equ 0001h
RXB1D4_RXB1D40_LENGTH                    equ 0001h
RXB1D4_RXB1D40_MASK                      equ 0001h
RXB1D4_RXB1D41_POSN                      equ 0001h
RXB1D4_RXB1D41_POSITION                  equ 0001h
RXB1D4_RXB1D41_SIZE                      equ 0001h
RXB1D4_RXB1D41_LENGTH                    equ 0001h
RXB1D4_RXB1D41_MASK                      equ 0002h
RXB1D4_RXB1D42_POSN                      equ 0002h
RXB1D4_RXB1D42_POSITION                  equ 0002h
RXB1D4_RXB1D42_SIZE                      equ 0001h
RXB1D4_RXB1D42_LENGTH                    equ 0001h
RXB1D4_RXB1D42_MASK                      equ 0004h
RXB1D4_RXB1D43_POSN                      equ 0003h
RXB1D4_RXB1D43_POSITION                  equ 0003h
RXB1D4_RXB1D43_SIZE                      equ 0001h
RXB1D4_RXB1D43_LENGTH                    equ 0001h
RXB1D4_RXB1D43_MASK                      equ 0008h
RXB1D4_RXB1D44_POSN                      equ 0004h
RXB1D4_RXB1D44_POSITION                  equ 0004h
RXB1D4_RXB1D44_SIZE                      equ 0001h
RXB1D4_RXB1D44_LENGTH                    equ 0001h
RXB1D4_RXB1D44_MASK                      equ 0010h
RXB1D4_RXB1D45_POSN                      equ 0005h
RXB1D4_RXB1D45_POSITION                  equ 0005h
RXB1D4_RXB1D45_SIZE                      equ 0001h
RXB1D4_RXB1D45_LENGTH                    equ 0001h
RXB1D4_RXB1D45_MASK                      equ 0020h
RXB1D4_RXB1D46_POSN                      equ 0006h
RXB1D4_RXB1D46_POSITION                  equ 0006h
RXB1D4_RXB1D46_SIZE                      equ 0001h
RXB1D4_RXB1D46_LENGTH                    equ 0001h
RXB1D4_RXB1D46_MASK                      equ 0040h
RXB1D4_RXB1D47_POSN                      equ 0007h
RXB1D4_RXB1D47_POSITION                  equ 0007h
RXB1D4_RXB1D47_SIZE                      equ 0001h
RXB1D4_RXB1D47_LENGTH                    equ 0001h
RXB1D4_RXB1D47_MASK                      equ 0080h

// Register: RXB1D5
#define RXB1D5 RXB1D5
RXB1D5                                   equ 0F5Bh
// bitfield definitions
RXB1D5_RXB1D50_POSN                      equ 0000h
RXB1D5_RXB1D50_POSITION                  equ 0000h
RXB1D5_RXB1D50_SIZE                      equ 0001h
RXB1D5_RXB1D50_LENGTH                    equ 0001h
RXB1D5_RXB1D50_MASK                      equ 0001h
RXB1D5_RXB1D51_POSN                      equ 0001h
RXB1D5_RXB1D51_POSITION                  equ 0001h
RXB1D5_RXB1D51_SIZE                      equ 0001h
RXB1D5_RXB1D51_LENGTH                    equ 0001h
RXB1D5_RXB1D51_MASK                      equ 0002h
RXB1D5_RXB1D52_POSN                      equ 0002h
RXB1D5_RXB1D52_POSITION                  equ 0002h
RXB1D5_RXB1D52_SIZE                      equ 0001h
RXB1D5_RXB1D52_LENGTH                    equ 0001h
RXB1D5_RXB1D52_MASK                      equ 0004h
RXB1D5_RXB1D53_POSN                      equ 0003h
RXB1D5_RXB1D53_POSITION                  equ 0003h
RXB1D5_RXB1D53_SIZE                      equ 0001h
RXB1D5_RXB1D53_LENGTH                    equ 0001h
RXB1D5_RXB1D53_MASK                      equ 0008h
RXB1D5_RXB1D54_POSN                      equ 0004h
RXB1D5_RXB1D54_POSITION                  equ 0004h
RXB1D5_RXB1D54_SIZE                      equ 0001h
RXB1D5_RXB1D54_LENGTH                    equ 0001h
RXB1D5_RXB1D54_MASK                      equ 0010h
RXB1D5_RXB1D55_POSN                      equ 0005h
RXB1D5_RXB1D55_POSITION                  equ 0005h
RXB1D5_RXB1D55_SIZE                      equ 0001h
RXB1D5_RXB1D55_LENGTH                    equ 0001h
RXB1D5_RXB1D55_MASK                      equ 0020h
RXB1D5_RXB1D56_POSN                      equ 0006h
RXB1D5_RXB1D56_POSITION                  equ 0006h
RXB1D5_RXB1D56_SIZE                      equ 0001h
RXB1D5_RXB1D56_LENGTH                    equ 0001h
RXB1D5_RXB1D56_MASK                      equ 0040h
RXB1D5_RXB1D57_POSN                      equ 0007h
RXB1D5_RXB1D57_POSITION                  equ 0007h
RXB1D5_RXB1D57_SIZE                      equ 0001h
RXB1D5_RXB1D57_LENGTH                    equ 0001h
RXB1D5_RXB1D57_MASK                      equ 0080h

// Register: RXB1D6
#define RXB1D6 RXB1D6
RXB1D6                                   equ 0F5Ch
// bitfield definitions
RXB1D6_RXB1D60_POSN                      equ 0000h
RXB1D6_RXB1D60_POSITION                  equ 0000h
RXB1D6_RXB1D60_SIZE                      equ 0001h
RXB1D6_RXB1D60_LENGTH                    equ 0001h
RXB1D6_RXB1D60_MASK                      equ 0001h
RXB1D6_RXB1D61_POSN                      equ 0001h
RXB1D6_RXB1D61_POSITION                  equ 0001h
RXB1D6_RXB1D61_SIZE                      equ 0001h
RXB1D6_RXB1D61_LENGTH                    equ 0001h
RXB1D6_RXB1D61_MASK                      equ 0002h
RXB1D6_RXB1D62_POSN                      equ 0002h
RXB1D6_RXB1D62_POSITION                  equ 0002h
RXB1D6_RXB1D62_SIZE                      equ 0001h
RXB1D6_RXB1D62_LENGTH                    equ 0001h
RXB1D6_RXB1D62_MASK                      equ 0004h
RXB1D6_RXB1D63_POSN                      equ 0003h
RXB1D6_RXB1D63_POSITION                  equ 0003h
RXB1D6_RXB1D63_SIZE                      equ 0001h
RXB1D6_RXB1D63_LENGTH                    equ 0001h
RXB1D6_RXB1D63_MASK                      equ 0008h
RXB1D6_RXB1D64_POSN                      equ 0004h
RXB1D6_RXB1D64_POSITION                  equ 0004h
RXB1D6_RXB1D64_SIZE                      equ 0001h
RXB1D6_RXB1D64_LENGTH                    equ 0001h
RXB1D6_RXB1D64_MASK                      equ 0010h
RXB1D6_RXB1D65_POSN                      equ 0005h
RXB1D6_RXB1D65_POSITION                  equ 0005h
RXB1D6_RXB1D65_SIZE                      equ 0001h
RXB1D6_RXB1D65_LENGTH                    equ 0001h
RXB1D6_RXB1D65_MASK                      equ 0020h
RXB1D6_RXB1D66_POSN                      equ 0006h
RXB1D6_RXB1D66_POSITION                  equ 0006h
RXB1D6_RXB1D66_SIZE                      equ 0001h
RXB1D6_RXB1D66_LENGTH                    equ 0001h
RXB1D6_RXB1D66_MASK                      equ 0040h
RXB1D6_RXB1D67_POSN                      equ 0007h
RXB1D6_RXB1D67_POSITION                  equ 0007h
RXB1D6_RXB1D67_SIZE                      equ 0001h
RXB1D6_RXB1D67_LENGTH                    equ 0001h
RXB1D6_RXB1D67_MASK                      equ 0080h

// Register: RXB1D7
#define RXB1D7 RXB1D7
RXB1D7                                   equ 0F5Dh
// bitfield definitions
RXB1D7_RXB1D70_POSN                      equ 0000h
RXB1D7_RXB1D70_POSITION                  equ 0000h
RXB1D7_RXB1D70_SIZE                      equ 0001h
RXB1D7_RXB1D70_LENGTH                    equ 0001h
RXB1D7_RXB1D70_MASK                      equ 0001h
RXB1D7_RXB1D71_POSN                      equ 0001h
RXB1D7_RXB1D71_POSITION                  equ 0001h
RXB1D7_RXB1D71_SIZE                      equ 0001h
RXB1D7_RXB1D71_LENGTH                    equ 0001h
RXB1D7_RXB1D71_MASK                      equ 0002h
RXB1D7_RXB1D72_POSN                      equ 0002h
RXB1D7_RXB1D72_POSITION                  equ 0002h
RXB1D7_RXB1D72_SIZE                      equ 0001h
RXB1D7_RXB1D72_LENGTH                    equ 0001h
RXB1D7_RXB1D72_MASK                      equ 0004h
RXB1D7_RXB1D73_POSN                      equ 0003h
RXB1D7_RXB1D73_POSITION                  equ 0003h
RXB1D7_RXB1D73_SIZE                      equ 0001h
RXB1D7_RXB1D73_LENGTH                    equ 0001h
RXB1D7_RXB1D73_MASK                      equ 0008h
RXB1D7_RXB1D74_POSN                      equ 0004h
RXB1D7_RXB1D74_POSITION                  equ 0004h
RXB1D7_RXB1D74_SIZE                      equ 0001h
RXB1D7_RXB1D74_LENGTH                    equ 0001h
RXB1D7_RXB1D74_MASK                      equ 0010h
RXB1D7_RXB1D75_POSN                      equ 0005h
RXB1D7_RXB1D75_POSITION                  equ 0005h
RXB1D7_RXB1D75_SIZE                      equ 0001h
RXB1D7_RXB1D75_LENGTH                    equ 0001h
RXB1D7_RXB1D75_MASK                      equ 0020h
RXB1D7_RXB1D76_POSN                      equ 0006h
RXB1D7_RXB1D76_POSITION                  equ 0006h
RXB1D7_RXB1D76_SIZE                      equ 0001h
RXB1D7_RXB1D76_LENGTH                    equ 0001h
RXB1D7_RXB1D76_MASK                      equ 0040h
RXB1D7_RXB1D77_POSN                      equ 0007h
RXB1D7_RXB1D77_POSITION                  equ 0007h
RXB1D7_RXB1D77_SIZE                      equ 0001h
RXB1D7_RXB1D77_LENGTH                    equ 0001h
RXB1D7_RXB1D77_MASK                      equ 0080h

// Register: CANSTAT_RO0
#define CANSTAT_RO0 CANSTAT_RO0
CANSTAT_RO0                              equ 0F5Eh
// bitfield definitions
CANSTAT_RO0_EICODE0_POSN                 equ 0000h
CANSTAT_RO0_EICODE0_POSITION             equ 0000h
CANSTAT_RO0_EICODE0_SIZE                 equ 0001h
CANSTAT_RO0_EICODE0_LENGTH               equ 0001h
CANSTAT_RO0_EICODE0_MASK                 equ 0001h
CANSTAT_RO0_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_RO0_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_RO0_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_RO0_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_RO0_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_RO0_EICODE2_ICODE1_POSN          equ 0002h
CANSTAT_RO0_EICODE2_ICODE1_POSITION      equ 0002h
CANSTAT_RO0_EICODE2_ICODE1_SIZE          equ 0001h
CANSTAT_RO0_EICODE2_ICODE1_LENGTH        equ 0001h
CANSTAT_RO0_EICODE2_ICODE1_MASK          equ 0004h
CANSTAT_RO0_EICODE3_ICODE2_POSN          equ 0003h
CANSTAT_RO0_EICODE3_ICODE2_POSITION      equ 0003h
CANSTAT_RO0_EICODE3_ICODE2_SIZE          equ 0001h
CANSTAT_RO0_EICODE3_ICODE2_LENGTH        equ 0001h
CANSTAT_RO0_EICODE3_ICODE2_MASK          equ 0008h
CANSTAT_RO0_EICODE4_POSN                 equ 0004h
CANSTAT_RO0_EICODE4_POSITION             equ 0004h
CANSTAT_RO0_EICODE4_SIZE                 equ 0001h
CANSTAT_RO0_EICODE4_LENGTH               equ 0001h
CANSTAT_RO0_EICODE4_MASK                 equ 0010h
CANSTAT_RO0_OPMODE0_POSN                 equ 0005h
CANSTAT_RO0_OPMODE0_POSITION             equ 0005h
CANSTAT_RO0_OPMODE0_SIZE                 equ 0001h
CANSTAT_RO0_OPMODE0_LENGTH               equ 0001h
CANSTAT_RO0_OPMODE0_MASK                 equ 0020h
CANSTAT_RO0_OPMODE1_POSN                 equ 0006h
CANSTAT_RO0_OPMODE1_POSITION             equ 0006h
CANSTAT_RO0_OPMODE1_SIZE                 equ 0001h
CANSTAT_RO0_OPMODE1_LENGTH               equ 0001h
CANSTAT_RO0_OPMODE1_MASK                 equ 0040h
CANSTAT_RO0_OPMODE2_POSN                 equ 0007h
CANSTAT_RO0_OPMODE2_POSITION             equ 0007h
CANSTAT_RO0_OPMODE2_SIZE                 equ 0001h
CANSTAT_RO0_OPMODE2_LENGTH               equ 0001h
CANSTAT_RO0_OPMODE2_MASK                 equ 0080h

// Register: CANCON_RO0
#define CANCON_RO0 CANCON_RO0
CANCON_RO0                               equ 0F5Fh
// bitfield definitions
CANCON_RO0_FP0_POSN                      equ 0000h
CANCON_RO0_FP0_POSITION                  equ 0000h
CANCON_RO0_FP0_SIZE                      equ 0001h
CANCON_RO0_FP0_LENGTH                    equ 0001h
CANCON_RO0_FP0_MASK                      equ 0001h
CANCON_RO0_WIN0_FP1_POSN                 equ 0001h
CANCON_RO0_WIN0_FP1_POSITION             equ 0001h
CANCON_RO0_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO0_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO0_WIN0_FP1_MASK                 equ 0002h
CANCON_RO0_WIN1_FP2_POSN                 equ 0002h
CANCON_RO0_WIN1_FP2_POSITION             equ 0002h
CANCON_RO0_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO0_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO0_WIN1_FP2_MASK                 equ 0004h
CANCON_RO0_WIN2_FP3_POSN                 equ 0003h
CANCON_RO0_WIN2_FP3_POSITION             equ 0003h
CANCON_RO0_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO0_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO0_WIN2_FP3_MASK                 equ 0008h
CANCON_RO0_ABAT_POSN                     equ 0004h
CANCON_RO0_ABAT_POSITION                 equ 0004h
CANCON_RO0_ABAT_SIZE                     equ 0001h
CANCON_RO0_ABAT_LENGTH                   equ 0001h
CANCON_RO0_ABAT_MASK                     equ 0010h
CANCON_RO0_REQOP0_POSN                   equ 0005h
CANCON_RO0_REQOP0_POSITION               equ 0005h
CANCON_RO0_REQOP0_SIZE                   equ 0001h
CANCON_RO0_REQOP0_LENGTH                 equ 0001h
CANCON_RO0_REQOP0_MASK                   equ 0020h
CANCON_RO0_REQOP1_POSN                   equ 0006h
CANCON_RO0_REQOP1_POSITION               equ 0006h
CANCON_RO0_REQOP1_SIZE                   equ 0001h
CANCON_RO0_REQOP1_LENGTH                 equ 0001h
CANCON_RO0_REQOP1_MASK                   equ 0040h
CANCON_RO0_REQOP2_POSN                   equ 0007h
CANCON_RO0_REQOP2_POSITION               equ 0007h
CANCON_RO0_REQOP2_SIZE                   equ 0001h
CANCON_RO0_REQOP2_LENGTH                 equ 0001h
CANCON_RO0_REQOP2_MASK                   equ 0080h

