GopalSaraf/Practicals/PSDL/include/proc/pic18lf6680.inc
#define TEC2                             BANKMASK(TXERRCNT), 2, a
#define TEC3                             BANKMASK(TXERRCNT), 3, a
#define TEC4                             BANKMASK(TXERRCNT), 4, a
#define TEC5                             BANKMASK(TXERRCNT), 5, a
#define TEC6                             BANKMASK(TXERRCNT), 6, a
#define TEC7                             BANKMASK(TXERRCNT), 7, a
#define TMR0IE                           BANKMASK(INTCON), 5, a
#define TMR0IF                           BANKMASK(INTCON), 2, a
#define TMR0IP                           BANKMASK(INTCON2), 2, a
#define TMR0ON                           BANKMASK(T0CON), 7, a
#define TMR1CS                           BANKMASK(T1CON), 1, a
#define TMR1IE                           BANKMASK(PIE1), 0, a
#define TMR1IF                           BANKMASK(PIR1), 0, a
#define TMR1IP                           BANKMASK(IPR1), 0, a
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE1), 1, a
#define TMR2IF                           BANKMASK(PIR1), 1, a
#define TMR2IP                           BANKMASK(IPR1), 1, a
#define TMR2ON                           BANKMASK(T2CON), 2, a
#define TMR3CS                           BANKMASK(T3CON), 1, a
#define TMR3IE                           BANKMASK(PIE2), 1, a
#define TMR3IF                           BANKMASK(PIR2), 1, a
#define TMR3IP                           BANKMASK(IPR2), 1, a
#define TMR3ON                           BANKMASK(T3CON), 0, a
#define TO                               BANKMASK(RCON), 3, a
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRISD0                           BANKMASK(TRISD), 0, a
#define TRISD1                           BANKMASK(TRISD), 1, a
#define TRISD2                           BANKMASK(TRISD), 2, a
#define TRISD3                           BANKMASK(TRISD), 3, a
#define TRISD4                           BANKMASK(TRISD), 4, a
#define TRISD5                           BANKMASK(TRISD), 5, a
#define TRISD6                           BANKMASK(TRISD), 6, a
#define TRISD7                           BANKMASK(TRISD), 7, a
#define TRISE0                           BANKMASK(TRISE), 0, a
#define TRISE1                           BANKMASK(TRISE), 1, a
#define TRISE2                           BANKMASK(TRISE), 2, a
#define TRISE3                           BANKMASK(TRISE), 3, a
#define TRISE4                           BANKMASK(TRISE), 4, a
#define TRISE5                           BANKMASK(TRISE), 5, a
#define TRISE6                           BANKMASK(TRISE), 6, a
#define TRISE7                           BANKMASK(TRISE), 7, a
#define TRISF0                           BANKMASK(TRISF), 0, a
#define TRISF1                           BANKMASK(TRISF), 1, a
#define TRISF2                           BANKMASK(TRISF), 2, a
#define TRISF3                           BANKMASK(TRISF), 3, a
#define TRISF4                           BANKMASK(TRISF), 4, a
#define TRISF5                           BANKMASK(TRISF), 5, a
#define TRISF6                           BANKMASK(TRISF), 6, a
#define TRISF7                           BANKMASK(TRISF), 7, a
#define TRISG0                           BANKMASK(TRISG), 0, a
#define TRISG1                           BANKMASK(TRISG), 1, a
#define TRISG2                           BANKMASK(TRISG), 2, a
#define TRISG3                           BANKMASK(TRISG), 3, a
#define TRISG4                           BANKMASK(TRISG), 4, a
#define TRMT                             BANKMASK(TXSTA), 1, a
#define TRMT1                            BANKMASK(TXSTA), 1, a
#define TX                               BANKMASK(PORTC), 6, a
#define TX0IE                            BANKMASK(TXBIE), 2, b
#define TX0IF                            BANKMASK(TXB0CON), 7, b
#define TX1IP                            BANKMASK(IPR1), 4, a
#define TX2EN                            BANKMASK(CIOCON), 6, a
#define TX2IE                            BANKMASK(TXBIE), 4, b
#define TX2IF                            BANKMASK(TXB2CON), 7, b
#define TX2SRC                           BANKMASK(CIOCON), 7, a
#define TX8_9                            BANKMASK(TXSTA), 6, a
#define TX9                              BANKMASK(TXSTA), 6, a
#define TX91                             BANKMASK(TXSTA), 6, a
#define TX9D                             BANKMASK(TXSTA), 0, a
#define TX9D1                            BANKMASK(TXSTA), 0, a
#define TXB0ABT                          BANKMASK(TXB0CON), 6, b
#define TXB0D00                          BANKMASK(TXB0D0), 0, b
#define TXB0D01                          BANKMASK(TXB0D0), 1, b
#define TXB0D02                          BANKMASK(TXB0D0), 2, b
#define TXB0D03                          BANKMASK(TXB0D0), 3, b
#define TXB0D04                          BANKMASK(TXB0D0), 4, b
#define TXB0D05                          BANKMASK(TXB0D0), 5, b
#define TXB0D06                          BANKMASK(TXB0D0), 6, b
#define TXB0D07                          BANKMASK(TXB0D0), 7, b
#define TXB0D10                          BANKMASK(TXB0D1), 0, b
#define TXB0D11                          BANKMASK(TXB0D1), 1, b
#define TXB0D12                          BANKMASK(TXB0D1), 2, b
#define TXB0D13                          BANKMASK(TXB0D1), 3, b
#define TXB0D14                          BANKMASK(TXB0D1), 4, b
#define TXB0D15                          BANKMASK(TXB0D1), 5, b
#define TXB0D16                          BANKMASK(TXB0D1), 6, b
#define TXB0D17                          BANKMASK(TXB0D1), 7, b
#define TXB0D20                          BANKMASK(TXB0D2), 0, b
#define TXB0D21                          BANKMASK(TXB0D2), 1, b
#define TXB0D22                          BANKMASK(TXB0D2), 2, b
#define TXB0D23                          BANKMASK(TXB0D2), 3, b
#define TXB0D24                          BANKMASK(TXB0D2), 4, b
#define TXB0D25                          BANKMASK(TXB0D2), 5, b
#define TXB0D26                          BANKMASK(TXB0D2), 6, b
#define TXB0D27                          BANKMASK(TXB0D2), 7, b
#define TXB0D30                          BANKMASK(TXB0D3), 0, b
#define TXB0D31                          BANKMASK(TXB0D3), 1, b
#define TXB0D32                          BANKMASK(TXB0D3), 2, b
#define TXB0D33                          BANKMASK(TXB0D3), 3, b
#define TXB0D34                          BANKMASK(TXB0D3), 4, b
#define TXB0D35                          BANKMASK(TXB0D3), 5, b
#define TXB0D36                          BANKMASK(TXB0D3), 6, b
#define TXB0D37                          BANKMASK(TXB0D3), 7, b
#define TXB0D40                          BANKMASK(TXB0D4), 0, b
#define TXB0D41                          BANKMASK(TXB0D4), 1, b
#define TXB0D42                          BANKMASK(TXB0D4), 2, b
#define TXB0D43                          BANKMASK(TXB0D4), 3, b
#define TXB0D44                          BANKMASK(TXB0D4), 4, b
#define TXB0D45                          BANKMASK(TXB0D4), 5, b
#define TXB0D46                          BANKMASK(TXB0D4), 6, b
#define TXB0D47                          BANKMASK(TXB0D4), 7, b
#define TXB0D50                          BANKMASK(TXB0D5), 0, b
#define TXB0D51                          BANKMASK(TXB0D5), 1, b
#define TXB0D52                          BANKMASK(TXB0D5), 2, b
#define TXB0D53                          BANKMASK(TXB0D5), 3, b
#define TXB0D54                          BANKMASK(TXB0D5), 4, b
#define TXB0D55                          BANKMASK(TXB0D5), 5, b
#define TXB0D56                          BANKMASK(TXB0D5), 6, b
#define TXB0D57                          BANKMASK(TXB0D5), 7, b
#define TXB0D60                          BANKMASK(TXB0D6), 0, b
#define TXB0D61                          BANKMASK(TXB0D6), 1, b
#define TXB0D62                          BANKMASK(TXB0D6), 2, b
#define TXB0D63                          BANKMASK(TXB0D6), 3, b
#define TXB0D64                          BANKMASK(TXB0D6), 4, b
#define TXB0D65                          BANKMASK(TXB0D6), 5, b
#define TXB0D66                          BANKMASK(TXB0D6), 6, b
#define TXB0D67                          BANKMASK(TXB0D6), 7, b
#define TXB0D70                          BANKMASK(TXB0D7), 0, b
#define TXB0D71                          BANKMASK(TXB0D7), 1, b
#define TXB0D72                          BANKMASK(TXB0D7), 2, b
#define TXB0D73                          BANKMASK(TXB0D7), 3, b
#define TXB0D74                          BANKMASK(TXB0D7), 4, b
#define TXB0D75                          BANKMASK(TXB0D7), 5, b
#define TXB0D76                          BANKMASK(TXB0D7), 6, b
#define TXB0D77                          BANKMASK(TXB0D7), 7, b
#define TXB0DLC0                         BANKMASK(TXB0DLC), 0, b
#define TXB0DLC1                         BANKMASK(TXB0DLC), 1, b
#define TXB0DLC2                         BANKMASK(TXB0DLC), 2, b
#define TXB0DLC3                         BANKMASK(TXB0DLC), 3, b
#define TXB0EID0                         BANKMASK(TXB0EIDL), 0, b
#define TXB0EID1                         BANKMASK(TXB0EIDL), 1, b
#define TXB0EID10                        BANKMASK(TXB0EIDH), 2, b
#define TXB0EID11                        BANKMASK(TXB0EIDH), 3, b
#define TXB0EID12                        BANKMASK(TXB0EIDH), 4, b
#define TXB0EID13                        BANKMASK(TXB0EIDH), 5, b
#define TXB0EID14                        BANKMASK(TXB0EIDH), 6, b
#define TXB0EID15                        BANKMASK(TXB0EIDH), 7, b
#define TXB0EID16                        BANKMASK(TXB0SIDL), 0, b
#define TXB0EID17                        BANKMASK(TXB0SIDL), 1, b
#define TXB0EID2                         BANKMASK(TXB0EIDL), 2, b
#define TXB0EID3                         BANKMASK(TXB0EIDL), 3, b
#define TXB0EID4                         BANKMASK(TXB0EIDL), 4, b
#define TXB0EID5                         BANKMASK(TXB0EIDL), 5, b
#define TXB0EID6                         BANKMASK(TXB0EIDL), 6, b
#define TXB0EID7                         BANKMASK(TXB0EIDL), 7, b
#define TXB0EID8                         BANKMASK(TXB0EIDH), 0, b
#define TXB0EID9                         BANKMASK(TXB0EIDH), 1, b
#define TXB0ERR                          BANKMASK(TXB0CON), 4, b
#define TXB0EXIDE                        BANKMASK(TXB0SIDL), 3, b
#define TXB0IF                           BANKMASK(PIR3), 2, a
#define TXB0IP                           BANKMASK(IPR3), 2, a
#define TXB0LARB                         BANKMASK(TXB0CON), 5, b
#define TXB0PRI0                         BANKMASK(TXB0CON), 0, b
#define TXB0PRI1                         BANKMASK(TXB0CON), 1, b
#define TXB0REQ                          BANKMASK(TXB0CON), 3, b
#define TXB0RTR                          BANKMASK(TXB0DLC), 6, b
#define TXB0SID0                         BANKMASK(TXB0SIDL), 5, b
#define TXB0SID1                         BANKMASK(TXB0SIDL), 6, b
#define TXB0SID10                        BANKMASK(TXB0SIDH), 7, b
#define TXB0SID2                         BANKMASK(TXB0SIDL), 7, b
#define TXB0SID3                         BANKMASK(TXB0SIDH), 0, b
#define TXB0SID4                         BANKMASK(TXB0SIDH), 1, b
#define TXB0SID5                         BANKMASK(TXB0SIDH), 2, b
#define TXB0SID6                         BANKMASK(TXB0SIDH), 3, b
#define TXB0SID7                         BANKMASK(TXB0SIDH), 4, b
#define TXB0SID8                         BANKMASK(TXB0SIDH), 5, b
#define TXB0SID9                         BANKMASK(TXB0SIDH), 6, b
#define TXB1ABT                          BANKMASK(TXB1CON), 6, b
#define TXB1D00                          BANKMASK(TXB1D0), 0, b
#define TXB1D01                          BANKMASK(TXB1D0), 1, b
#define TXB1D02                          BANKMASK(TXB1D0), 2, b
#define TXB1D03                          BANKMASK(TXB1D0), 3, b
#define TXB1D04                          BANKMASK(TXB1D0), 4, b
#define TXB1D05                          BANKMASK(TXB1D0), 5, b
#define TXB1D06                          BANKMASK(TXB1D0), 6, b
#define TXB1D07                          BANKMASK(TXB1D0), 7, b
#define TXB1D10                          BANKMASK(TXB1D1), 0, b
#define TXB1D11                          BANKMASK(TXB1D1), 1, b
#define TXB1D12                          BANKMASK(TXB1D1), 2, b
#define TXB1D13                          BANKMASK(TXB1D1), 3, b
#define TXB1D14                          BANKMASK(TXB1D1), 4, b
#define TXB1D15                          BANKMASK(TXB1D1), 5, b
#define TXB1D16                          BANKMASK(TXB1D1), 6, b
#define TXB1D17                          BANKMASK(TXB1D1), 7, b
#define TXB1D20                          BANKMASK(TXB1D2), 0, b
#define TXB1D21                          BANKMASK(TXB1D2), 1, b
#define TXB1D22                          BANKMASK(TXB1D2), 2, b
#define TXB1D23                          BANKMASK(TXB1D2), 3, b
#define TXB1D24                          BANKMASK(TXB1D2), 4, b
#define TXB1D25                          BANKMASK(TXB1D2), 5, b
#define TXB1D26                          BANKMASK(TXB1D2), 6, b
#define TXB1D27                          BANKMASK(TXB1D2), 7, b
#define TXB1D30                          BANKMASK(TXB1D3), 0, b
#define TXB1D31                          BANKMASK(TXB1D3), 1, b
#define TXB1D32                          BANKMASK(TXB1D3), 2, b
#define TXB1D33                          BANKMASK(TXB1D3), 3, b
#define TXB1D34                          BANKMASK(TXB1D3), 4, b
#define TXB1D35                          BANKMASK(TXB1D3), 5, b
#define TXB1D36                          BANKMASK(TXB1D3), 6, b
#define TXB1D37                          BANKMASK(TXB1D3), 7, b
#define TXB1D40                          BANKMASK(TXB1D4), 0, b
#define TXB1D41                          BANKMASK(TXB1D4), 1, b
#define TXB1D42                          BANKMASK(TXB1D4), 2, b
#define TXB1D43                          BANKMASK(TXB1D4), 3, b
#define TXB1D44                          BANKMASK(TXB1D4), 4, b
#define TXB1D45                          BANKMASK(TXB1D4), 5, b
#define TXB1D46                          BANKMASK(TXB1D4), 6, b
#define TXB1D47                          BANKMASK(TXB1D4), 7, b
#define TXB1D50                          BANKMASK(TXB1D5), 0, b
#define TXB1D51                          BANKMASK(TXB1D5), 1, b
#define TXB1D52                          BANKMASK(TXB1D5), 2, b
#define TXB1D53                          BANKMASK(TXB1D5), 3, b
#define TXB1D54                          BANKMASK(TXB1D5), 4, b
#define TXB1D55                          BANKMASK(TXB1D5), 5, b
#define TXB1D56                          BANKMASK(TXB1D5), 6, b
#define TXB1D57                          BANKMASK(TXB1D5), 7, b
#define TXB1D60                          BANKMASK(TXB1D6), 0, b
#define TXB1D61                          BANKMASK(TXB1D6), 1, b
#define TXB1D62                          BANKMASK(TXB1D6), 2, b
#define TXB1D63                          BANKMASK(TXB1D6), 3, b
#define TXB1D64                          BANKMASK(TXB1D6), 4, b
#define TXB1D65                          BANKMASK(TXB1D6), 5, b
#define TXB1D66                          BANKMASK(TXB1D6), 6, b
#define TXB1D67                          BANKMASK(TXB1D6), 7, b
#define TXB1D70                          BANKMASK(TXB1D7), 0, b
#define TXB1D71                          BANKMASK(TXB1D7), 1, b
#define TXB1D72                          BANKMASK(TXB1D7), 2, b
#define TXB1D73                          BANKMASK(TXB1D7), 3, b
#define TXB1D74                          BANKMASK(TXB1D7), 4, b
#define TXB1D75                          BANKMASK(TXB1D7), 5, b
#define TXB1D76                          BANKMASK(TXB1D7), 6, b
#define TXB1D77                          BANKMASK(TXB1D7), 7, b
#define TXB1DLC0                         BANKMASK(TXB1DLC), 0, b
#define TXB1DLC1                         BANKMASK(TXB1DLC), 1, b
#define TXB1DLC2                         BANKMASK(TXB1DLC), 2, b
#define TXB1DLC3                         BANKMASK(TXB1DLC), 3, b
#define TXB1EID0                         BANKMASK(TXB1EIDL), 0, b
#define TXB1EID1                         BANKMASK(TXB1EIDL), 1, b
#define TXB1EID10                        BANKMASK(TXB1EIDH), 2, b
#define TXB1EID11                        BANKMASK(TXB1EIDH), 3, b
#define TXB1EID12                        BANKMASK(TXB1EIDH), 4, b
#define TXB1EID13                        BANKMASK(TXB1EIDH), 5, b
#define TXB1EID14                        BANKMASK(TXB1EIDH), 6, b
#define TXB1EID15                        BANKMASK(TXB1EIDH), 7, b
#define TXB1EID16                        BANKMASK(TXB1SIDL), 0, b
#define TXB1EID17                        BANKMASK(TXB1SIDL), 1, b
#define TXB1EID2                         BANKMASK(TXB1EIDL), 2, b
#define TXB1EID3                         BANKMASK(TXB1EIDL), 3, b
#define TXB1EID4                         BANKMASK(TXB1EIDL), 4, b
#define TXB1EID5                         BANKMASK(TXB1EIDL), 5, b
#define TXB1EID6                         BANKMASK(TXB1EIDL), 6, b
#define TXB1EID7                         BANKMASK(TXB1EIDL), 7, b
#define TXB1EID8                         BANKMASK(TXB1EIDH), 0, b
#define TXB1EID9                         BANKMASK(TXB1EIDH), 1, b
#define TXB1ERR                          BANKMASK(TXB1CON), 4, b
#define TXB1EXIDE                        BANKMASK(TXB1SIDL), 3, b
#define TXB1IF                           BANKMASK(PIR3), 3, a
#define TXB1IP                           BANKMASK(IPR3), 3, a
#define TXB1LARB                         BANKMASK(TXB1CON), 5, b
#define TXB1PRI0                         BANKMASK(TXB1CON), 0, b
#define TXB1PRI1                         BANKMASK(TXB1CON), 1, b
#define TXB1REQ                          BANKMASK(TXB1CON), 3, b
#define TXB1RTR                          BANKMASK(TXB1DLC), 6, b
#define TXB1SID0                         BANKMASK(TXB1SIDL), 5, b
#define TXB1SID1                         BANKMASK(TXB1SIDL), 6, b
#define TXB1SID10                        BANKMASK(TXB1SIDH), 7, b
#define TXB1SID2                         BANKMASK(TXB1SIDL), 7, b
#define TXB1SID3                         BANKMASK(TXB1SIDH), 0, b
#define TXB1SID4                         BANKMASK(TXB1SIDH), 1, b
#define TXB1SID5                         BANKMASK(TXB1SIDH), 2, b
#define TXB1SID6                         BANKMASK(TXB1SIDH), 3, b
#define TXB1SID7                         BANKMASK(TXB1SIDH), 4, b
#define TXB1SID8                         BANKMASK(TXB1SIDH), 5, b
#define TXB1SID9                         BANKMASK(TXB1SIDH), 6, b
#define TXB2ABT                          BANKMASK(TXB2CON), 6, b
#define TXB2D00                          BANKMASK(TXB2D0), 0, b
#define TXB2D01                          BANKMASK(TXB2D0), 1, b
#define TXB2D02                          BANKMASK(TXB2D0), 2, b
#define TXB2D03                          BANKMASK(TXB2D0), 3, b
#define TXB2D04                          BANKMASK(TXB2D0), 4, b
#define TXB2D05                          BANKMASK(TXB2D0), 5, b
#define TXB2D06                          BANKMASK(TXB2D0), 6, b
#define TXB2D07                          BANKMASK(TXB2D0), 7, b
#define TXB2D10                          BANKMASK(TXB2D1), 0, b
#define TXB2D11                          BANKMASK(TXB2D1), 1, b
#define TXB2D12                          BANKMASK(TXB2D1), 2, b
#define TXB2D13                          BANKMASK(TXB2D1), 3, b
#define TXB2D14                          BANKMASK(TXB2D1), 4, b
#define TXB2D15                          BANKMASK(TXB2D1), 5, b
#define TXB2D16                          BANKMASK(TXB2D1), 6, b
#define TXB2D17                          BANKMASK(TXB2D1), 7, b
#define TXB2D20                          BANKMASK(TXB2D2), 0, b
#define TXB2D21                          BANKMASK(TXB2D2), 1, b
#define TXB2D22                          BANKMASK(TXB2D2), 2, b
#define TXB2D23                          BANKMASK(TXB2D2), 3, b
#define TXB2D24                          BANKMASK(TXB2D2), 4, b
#define TXB2D25                          BANKMASK(TXB2D2), 5, b
#define TXB2D26                          BANKMASK(TXB2D2), 6, b
#define TXB2D27                          BANKMASK(TXB2D2), 7, b
#define TXB2D30                          BANKMASK(TXB2D3), 0, b
#define TXB2D31                          BANKMASK(TXB2D3), 1, b
#define TXB2D32                          BANKMASK(TXB2D3), 2, b
#define TXB2D33                          BANKMASK(TXB2D3), 3, b
#define TXB2D34                          BANKMASK(TXB2D3), 4, b
#define TXB2D35                          BANKMASK(TXB2D3), 5, b
#define TXB2D36                          BANKMASK(TXB2D3), 6, b
#define TXB2D37                          BANKMASK(TXB2D3), 7, b
#define TXB2D40                          BANKMASK(TXB2D4), 0, b
#define TXB2D41                          BANKMASK(TXB2D4), 1, b
#define TXB2D42                          BANKMASK(TXB2D4), 2, b
#define TXB2D43                          BANKMASK(TXB2D4), 3, b
#define TXB2D44                          BANKMASK(TXB2D4), 4, b
#define TXB2D45                          BANKMASK(TXB2D4), 5, b
#define TXB2D46                          BANKMASK(TXB2D4), 6, b
#define TXB2D47                          BANKMASK(TXB2D4), 7, b
#define TXB2D50                          BANKMASK(TXB2D5), 0, b
#define TXB2D51                          BANKMASK(TXB2D5), 1, b
#define TXB2D52                          BANKMASK(TXB2D5), 2, b
#define TXB2D53                          BANKMASK(TXB2D5), 3, b
#define TXB2D54                          BANKMASK(TXB2D5), 4, b
#define TXB2D55                          BANKMASK(TXB2D5), 5, b
#define TXB2D56                          BANKMASK(TXB2D5), 6, b
#define TXB2D57                          BANKMASK(TXB2D5), 7, b
#define TXB2D60                          BANKMASK(TXB2D6), 0, b
#define TXB2D61                          BANKMASK(TXB2D6), 1, b
#define TXB2D62                          BANKMASK(TXB2D6), 2, b
#define TXB2D63                          BANKMASK(TXB2D6), 3, b
#define TXB2D64                          BANKMASK(TXB2D6), 4, b
#define TXB2D65                          BANKMASK(TXB2D6), 5, b
#define TXB2D66                          BANKMASK(TXB2D6), 6, b
#define TXB2D67                          BANKMASK(TXB2D6), 7, b
#define TXB2D70                          BANKMASK(TXB2D7), 0, b
#define TXB2D71                          BANKMASK(TXB2D7), 1, b
#define TXB2D72                          BANKMASK(TXB2D7), 2, b
#define TXB2D73                          BANKMASK(TXB2D7), 3, b
#define TXB2D74                          BANKMASK(TXB2D7), 4, b
#define TXB2D75                          BANKMASK(TXB2D7), 5, b
#define TXB2D76                          BANKMASK(TXB2D7), 6, b
#define TXB2D77                          BANKMASK(TXB2D7), 7, b
#define TXB2DLC0                         BANKMASK(TXB2DLC), 0, b
#define TXB2DLC1                         BANKMASK(TXB2DLC), 1, b
#define TXB2DLC2                         BANKMASK(TXB2DLC), 2, b
